# import libs

In [1]:
import os
import pandas as pd
from datetime import datetime, timedelta

from sqlalchemy import create_engine, text

import random
from faker import Faker

# connection

In [2]:
# строка подключения
engine = create_engine("postgresql+psycopg2://test_user:test_pass@localhost:5432/test_db")

# список таблиц
with engine.connect() as conn:
    df = pd.read_sql("SELECT table_name FROM information_schema.tables WHERE table_schema='public';", conn)
df

                    table_name
0                 dim_channels
1                dim_campaigns
2                dim_templates
3   dim_communication_statuses
4      campaign_communications
5                       events
6                 sessions_log
7                   dim_events
8                transaction_f
9              dim_application
10                 fact_events

# mock-data seed

In [3]:
# reproducibility
random.seed(422)
Faker.seed(42)
fake = Faker()

# подключение к БД
engine = create_engine("postgresql+psycopg2://test_user:test_pass@localhost:5432/test_db")

In [4]:
def display_tables(table_list:list):
    for table in table_list:
        tmp = pd.read_sql(f'select * from {table}', engine)
        print(table, tmp.shape)
        display(tmp.head(5))
        # display(.tail(5))

# Task: 1

In [5]:
# ---------- dim_channels ----------
channels = [
    {"id": 1, "name": "SMS", "row_actual_from_ts": "2000-01-01", "row_actual_to": "2099-12-31"},
    {"id": 2, "name": "Email", "row_actual_from_ts": "2000-01-01", "row_actual_to": "2099-12-31"},
    {"id": 3, "name": "PUSH", "row_actual_from_ts": "2000-01-01", "row_actual_to": "2023-10-31"},
    {"id": 4, "name": "PUSH", "row_actual_from_ts": "2023-11-01", "row_actual_to": "2099-12-31"},
]
pd.DataFrame(channels).to_sql("dim_channels", engine, if_exists="replace", index=False)

# ---------- dim_campaigns ----------
campaigns = []
for i in range(1, 21):
    start = fake.date_time_between_dates(
    datetime_start=datetime(2023,1,1), datetime_end=datetime(2023,12,31)
    )
    campaigns.append({
        "id": i,
        "campaign_name": f"Campaign_{i}",
        "started_ts": start,
        "ended_ts": start + timedelta(days=random.randint(3,10)),
        "channel_id": random.choice([1,2,3,4])
    })
pd.DataFrame(campaigns).to_sql("dim_campaigns", engine, if_exists="replace", index=False)

# ---------- dim_templates ----------
templates = []
for i in range(1, 11):
    start = fake.date_time_between_dates(
        datetime_start=datetime(2020,1,1), datetime_end=datetime(2022,12,31)
    )
    templates.append({
        "id": i,
        "channel_id": random.choice([1,2,3,4]),
        "template_text": fake.sentence(),
        "row_actual_from_ts": start,
        "row_actual_to": "2099-12-31"
    })
pd.DataFrame(templates).to_sql("dim_templates", engine, if_exists="replace", index=False)

# ---------- dim_communication_statuses ----------
statuses = [
    {"id": 1, "status_name": "error"},
    {"id": 2, "status_name": "unsent"},
    {"id": 3, "status_name": "sent"},
    {"id": 4, "status_name": "delivered"},
    {"id": 5, "status_name": "read"},
]
df_status = pd.DataFrame(statuses)
df_status["row_actual_from"] = "2000-01-01"
df_status["row_actual_to"] = "2099-12-31"
df_status.to_sql("dim_communication_statuses", engine, if_exists="replace", index=False)

# ---------- campaign_communications ----------
comms = []
for i in range(1, 1001):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,6,1), datetime_end=datetime(2023,12,31)
    )
    comms.append({
        "id": i,
        "communication_id": random.randint(100000, 999999),
        "campaign_id": random.choice(range(1,21)),
        "status_ts": ts,
        "user_id": random.randint(10000, 99999),
        "communication_status_id": random.choice([1,2,3,4,5])
    })
pd.DataFrame(comms).to_sql("campaign_communications", engine, if_exists="replace", index=False)
first_task_tables = [
    'dim_channels',
    'dim_campaigns',
    'campaign_communications',
    'dim_communication_statuses',
    'dim_templates',
]
display_tables(first_task_tables)

dim_channels (4, 4)

   id   name row_actual_from_ts row_actual_to
0   1    SMS         2000-01-01    2099-12-31
1   2  Email         2000-01-01    2099-12-31
2   3   PUSH         2000-01-01    2023-10-31
3   4   PUSH         2023-11-01    2099-12-31

dim_campaigns (20, 5)

,id,campaign_name,started_ts,ended_ts,channel_id
0,1,Campaign_1,2023-08-21 18:01:57.040781,2023-08-30 18:01:57.040781,3
1,2,Campaign_2,2023-01-10 02:29:38.247451,2023-01-13 02:29:38.247451,3
2,3,Campaign_3,2023-04-11 02:39:22.050982,2023-04-15 02:39:22.050982,2
3,4,Campaign_4,2023-03-23 05:58:08.430485,2023-03-30 05:58:08.430485,1
4,5,Campaign_5,2023-09-26 01:48:45.096972,2023-10-06 01:48:45.096972,3

campaign_communications (1000, 6)

,id,communication_id,campaign_id,status_ts,user_id,communication_status_id
0,1,703116,15,2023-10-23 22:37:11.868216,60416,2
1,2,267981,2,2023-10-06 00:50:34.674367,58589,4
2,3,834667,10,2023-08-21 22:55:49.790208,70395,4
3,4,145435,16,2023-10-05 22:10:53.924815,87608,5
4,5,389104,10,2023-09-08 16:40:15.694879,67212,1

dim_communication_statuses (5, 4)

   id status_name row_actual_from row_actual_to
0   1       error      2000-01-01    2099-12-31
1   2      unsent      2000-01-01    2099-12-31
2   3        sent      2000-01-01    2099-12-31
3   4   delivered      2000-01-01    2099-12-31
4   5        read      2000-01-01    2099-12-31

dim_templates (10, 5)

,id,channel_id,template_text,row_actual_from_ts,row_actual_to
0,1,1,Future choice whatever from behavior benefit.,2022-06-01 08:55:47.777398,2099-12-31
1,2,1,Enough analysis least by two bad fall pick.,2022-07-17 00:09:07.011400,2099-12-31
2,3,3,Officer relate animal direction eye bag.,2022-08-27 13:40:18.968805,2099-12-31
3,4,4,Herself law street class.,2020-09-11 21:44:40.176844,2099-12-31
4,5,2,Reduce raise author play move.,2021-01-24 00:30:50.407125,2099-12-31

Определить процент доставляемости  PUSH-рассылок в рекламных кампаниях запущенных за 3-4 кварталы 2023 года.  В журнал пишутся все статусы по каждой коммуникации
- По каждой кампании (кампания, дата старта кампании, % успешных доставок (delivered))

In [6]:
query1_1 = text("""
WITH channels_q AS (
    SELECT id, name
    FROM dim_channels
    WHERE name = 'PUSH'
),

campaigns_q AS (
    SELECT 
        id, 
        campaign_name, 
        started_ts, 
        channel_id
    FROM dim_campaigns
    WHERE started_ts BETWEEN '2023-07-01' AND '2023-12-31'
),

communications_q AS (
    SELECT 
        communication_id, 
        campaign_id, 
        communication_status_id
    FROM campaign_communications
),

statuses_q AS (
    SELECT 
        id, 
        status_name
    FROM dim_communication_statuses
)

SELECT
    campaigns_q.campaign_name,
    campaigns_q.started_ts::date,
    ROUND(
        SUM(CASE WHEN statuses_q.status_name = 'delivered' THEN 1 ELSE 0 END) 
        * 100.0 / 
        NULLIF(COUNT(DISTINCT communications_q.communication_id), 0),
        2
    ) AS delivered_percent
FROM campaigns_q
JOIN channels_q ON campaigns_q.channel_id = channels_q.id
LEFT JOIN communications_q ON campaigns_q.id = communications_q.campaign_id
LEFT JOIN statuses_q ON communications_q.communication_status_id = statuses_q.id
GROUP BY campaigns_q.campaign_name, campaigns_q.started_ts
ORDER BY campaigns_q.started_ts;
""")

df1_1 = pd.read_sql(query1_1, engine)
df1_1

  campaign_name  started_ts  delivered_percent
0   Campaign_18  2023-08-03              24.53
1    Campaign_1  2023-08-21              29.17
2   Campaign_15  2023-08-25              30.91
3    Campaign_5  2023-09-26              21.05
4    Campaign_7  2023-11-21               8.89

- В среднем по каналу за каждый месяц (месяц, % успешных доставок) <br>
За каждый месяц чего? Старта кампании или отправки коммуникации?

In [7]:
query1_2 = text("""
WITH campaigns_q AS (
    SELECT
        id,
        campaign_name,
        started_ts,
        channel_id
    FROM dim_campaigns
    WHERE started_ts BETWEEN '2023-07-01' AND '2023-12-31'
),

channels_q AS (
    SELECT
        id,
        name
    FROM dim_channels
    WHERE name = 'PUSH'
),

statuses_q AS (
    SELECT
        id,
        status_name
    FROM dim_communication_statuses
),

communications_q AS (
    SELECT
        communication_id,
        campaign_id,
        communication_status_id,
        status_ts
    FROM campaign_communications
),

joined AS (
    SELECT
        DATE_TRUNC('month', communications_q.status_ts) AS month,
        channels_q.id AS channel_id,
        channels_q.name AS channel_name,
        ROUND(
            100.0 * SUM(
                CASE WHEN statuses_q.status_name = 'delivered' THEN 1 ELSE 0 END
            ) / NULLIF(COUNT(DISTINCT communications_q.communication_id), 0),
            2
        ) AS delivered_percent
    FROM campaigns_q
    JOIN channels_q
        ON campaigns_q.channel_id = channels_q.id
    LEFT JOIN communications_q
        ON communications_q.campaign_id = campaigns_q.id
    LEFT JOIN statuses_q
        ON communications_q.communication_status_id = statuses_q.id
    GROUP BY
        DATE_TRUNC('month', communications_q.status_ts),
        channels_q.id,
        channels_q.name
)

SELECT
    joined.month,
    joined.channel_id,
    joined.channel_name,
    joined.delivered_percent
FROM joined
ORDER BY
    joined.channel_id,
    joined.month;
""")

df1_2 = pd.read_sql(query1_2, engine)
df1_2

        month  channel_id channel_name  delivered_percent
0  2023-06-01           3         PUSH              24.00
1  2023-07-01           3         PUSH              20.83
2  2023-08-01           3         PUSH              13.64
3  2023-09-01           3         PUSH              21.43
4  2023-10-01           3         PUSH              20.00
5  2023-11-01           3         PUSH              12.50
6  2023-12-01           3         PUSH              25.00
7  2023-06-01           4         PUSH              27.78
8  2023-07-01           4         PUSH              36.84
9  2023-08-01           4         PUSH               0.00
10 2023-09-01           4         PUSH              22.22
11 2023-10-01           4         PUSH              29.41
12 2023-11-01           4         PUSH              30.00
13 2023-12-01           4         PUSH              40.00

# Task: 2

In [8]:
# ---------- events ----------
events = []
for i in range(1, 501):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,11,1), datetime_end=datetime(2023,11,5)
    )
    events.append({
        "user_id": random.randint(1,10),
        "event_type": random.choice(["authorization", "scroll", "calculator", "push_button"]),
        "event_time": ts
    })
pd.DataFrame(events).to_sql("events", engine, if_exists="replace", index=False)
display_tables(['events'])

events (500, 3)

   user_id     event_type                 event_time
0        9  authorization 2023-11-01 08:11:41.921894
1       10  authorization 2023-11-02 17:27:36.524812
2        2  authorization 2023-11-03 23:28:49.947753
3        5         scroll 2023-11-02 11:46:26.754600
4        3    push_button 2023-11-01 12:29:27.900755

Определить сессии пользователя по следующим условиям. Сессией считается последовательность действий пользователя, где разница во времени между последовательными событиями меньше или равна 30 минутам. Если время между двумя событиями превышает 30 минут, это считается началом новой сессии.

Для каждой сессии вычислите следующие колонки:
- session_id : уникальный идентификатор для каждой сессии.
- session_start_time : временная метка первого события в сессии.
- session_end_time : временная метка последнего события в сессии.
- session_duration : разница между session_end_time и session_start_time.
- event_count : количество событий в сессии.

In [9]:
query2 = text("""
WITH events_sorted AS (
    SELECT
        user_id,
        event_time,
        LAG(event_time) OVER (
            PARTITION BY user_id
            ORDER BY event_time
        ) AS prev_time
    FROM events
),

sessions AS (
    SELECT
        user_id,
        event_time,
        CASE
            WHEN prev_time IS NULL
                 OR event_time - prev_time > INTERVAL '30 minutes'
            THEN 1 ELSE 0
        END AS is_new_session
    FROM events_sorted
),

session_marks AS (
    SELECT
        user_id,
        event_time,
        SUM(is_new_session) OVER (
            PARTITION BY user_id
            ORDER BY event_time
        ) AS session_number
    FROM sessions
)

SELECT
    user_id,
    MD5(user_id::text || '-' || session_number::text) AS session_id,
    MIN(event_time) AS session_start_time,
    MAX(event_time) AS session_end_time,
    ROUND(
        EXTRACT(EPOCH FROM (MAX(event_time) - MIN(event_time))) / 60,
        2
    ) AS session_duration_minutes,
    COUNT(*) AS event_count
FROM session_marks
GROUP BY
    user_id,
    session_number
HAVING
    COUNT(*) > 1
ORDER BY
    user_id,
    session_start_time;
""")

df2 = pd.read_sql(query2, engine)
df2.head(10)

,user_id,session_id,session_start_time,session_end_time,session_duration_minutes,event_count
0,1,98c6f2c2287f4c73cea3d40ae7ec3ff2,2023-11-01 02:29:15.650603,2023-11-01 02:46:46.219375,17.51,2
1,1,3a170a9fe4f47efa37d23ad521b9098e,2023-11-01 04:10:45.497338,2023-11-01 05:00:33.340007,49.80,4
2,1,12426c956d1bc5017082b12a969b0b7c,2023-11-01 08:05:44.148028,2023-11-01 08:07:58.890548,2.25,2
3,1,d04b95489bc4e2bc1187bbfa7ef0ba59,2023-11-01 12:56:45.052061,2023-11-01 13:01:47.741168,5.04,2
4,1,c96e299b7d0fcbe6c3e5b1d786f6d72d,2023-11-02 03:27:59.925503,2023-11-02 04:23:45.750332,55.76,3
5,1,da018aac8db212cc48f184b05d0aef27,2023-11-02 08:07:34.814413,2023-11-02 08:11:16.347005,3.69,2
6,1,012565dbbc52f089dd827d084728c0d8,2023-11-02 11:13:37.902255,2023-11-02 11:38:10.904042,24.55,2
7,1,1edba7e604b9dd9b9ce6307a75a062f3,2023-11-03 09:01:53.985318,2023-11-03 09:20:08.370034,18.24,2
8,1,332c3d188638266cf7054576d248ff3a,2023-11-03 10:16:45.468172,2023-11-03 10:27:48.642815,11.05,2
9,1,158ba0b7a9c429af623fe2ada5c30550,2023-11-04 12:48:03.058969,2023-11-04 12:55:28.049797,7.42,2

# Task: 3

In [10]:
# ---------- sessions_log ----------
logs = []
for i in range(1, 5001):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,11,1), datetime_end=datetime(2023,12,31)
    )
    logs.append({
        "id": i,
        "session_id": random.randint(1,50),
        "user_id": random.randint(1,5),
        "event_id": random.choice(range(1,21)),
        "time_stamp": ts
    })
pd.DataFrame(logs).to_sql("sessions_log", engine, if_exists="replace", index=False)

# ---------- dim_events ----------
dim_ev = []
for i in range(1, 21):
    dim_ev.append({
        "id": i,
        "event_name": fake.word(),
        "row_actual_from": "2000-01-01",
        "row_actual_to": "2099-12-31"
    })
pd.DataFrame(dim_ev).to_sql("dim_events", engine, if_exists="replace", index=False)
display_tables(['sessions_log','dim_events'])

sessions_log (5000, 5)

   id  session_id  user_id  event_id                 time_stamp
0   1          26        4         9 2023-11-12 18:40:29.150600
1   2          28        3         3 2023-12-28 09:08:46.834592
2   3          25        4        19 2023-11-17 11:12:34.156179
3   4           7        4        13 2023-12-08 12:01:55.921750
4   5          19        2         8 2023-12-07 20:46:36.194750

dim_events (20, 4)

   id event_name row_actual_from row_actual_to
0   1   business      2000-01-01    2099-12-31
1   2       want      2000-01-01    2099-12-31
2   3     within      2000-01-01    2099-12-31
3   4       miss      2000-01-01    2099-12-31
4   5     amount      2000-01-01    2099-12-31

Определить за каждую неделю с 1 мая 2023 года топ 10 событий, на которых заканчиваются пользовательские сессии.

In [11]:
query3 = text("""
WITH last_events AS (
    SELECT
        sessions_log.session_id,
        sessions_log.user_id,
        sessions_log.event_id,
        sessions_log.time_stamp,
        ROW_NUMBER() OVER (
            PARTITION BY sessions_log.user_id, sessions_log.session_id
            ORDER BY sessions_log.time_stamp DESC
        ) AS rn
    FROM sessions_log
    WHERE sessions_log.time_stamp >= '2023-05-01'
),

ranked AS (
    SELECT
        DATE_TRUNC('week', last_events.time_stamp) AS week_start,
        dim_events.event_name,
        COUNT(*) AS event_count,
        ROW_NUMBER() OVER (
            PARTITION BY DATE_TRUNC('week', last_events.time_stamp)
            ORDER BY COUNT(*) DESC
        ) AS rank_in_week
    FROM last_events
    JOIN dim_events
        ON last_events.event_id = dim_events.id
    WHERE last_events.rn = 1
    GROUP BY
        DATE_TRUNC('week', last_events.time_stamp),
        dim_events.event_name
    HAVING
        COUNT(*) > 0
)

SELECT
    ranked.week_start,
    ranked.event_name,
    ranked.event_count,
    ranked.rank_in_week
FROM ranked
WHERE ranked.rank_in_week <= 10
ORDER BY
    ranked.week_start,
    ranked.rank_in_week;
""")

df3 = pd.read_sql(query3, engine)
print(df3.shape)
df3

(24, 4)

   week_start  event_name  event_count  rank_in_week
0  2023-12-04       happy            1             1
1  2023-12-11   candidate            1             1
2  2023-12-11       happy            1             2
3  2023-12-11        mind            1             3
4  2023-12-18      memory            4             1
5  2023-12-18       happy            4             2
6  2023-12-18        miss            4             3
7  2023-12-18     service            4             4
8  2023-12-18   candidate            3             5
9  2023-12-18        mind            3             6
10 2023-12-18    security            3             7
11 2023-12-18  throughout            3             8
12 2023-12-18      amount            2             9
13 2023-12-18      better            2            10
14 2023-12-25        mind           15             1
15 2023-12-25       heavy           15             2
16 2023-12-25      letter           14             3
17 2023-12-25    security           14             4
18 2023-12-25       happy           14             5
19 2023-12-25   candidate           12             6
20 2023-12-25      amount           11             7
21 2023-12-25      budget           11             8
22 2023-12-25         lot           11             9
23 2023-12-25      memory           10            10

# Task: 4

In [12]:
# ---------- transaction_f ----------
transactions = []
for i in range(1, 501):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,5,1), datetime_end=datetime(2023,12,31)
    )
    transactions.append({
        "id": i,
        "created_ts": ts,
        "client_key": random.randint(1000,1200),
        "amount": round(random.uniform(10, 5000), 2),
        "application_id": random.choice([12,13])
    })
pd.DataFrame(transactions).to_sql("transaction_f", engine, if_exists="replace", index=False)

# ---------- dim_application ----------
apps = [
    {"id": 1, "application_id": 12, "application_name": "Taxi", "row_actual_from": "2023-01-01", "row_actual_to": "2099-12-31"},
    {"id": 2, "application_id": 13, "application_name": "SuperAppPlus", "row_actual_from": "2023-01-01", "row_actual_to": "2099-12-31"},
]
pd.DataFrame(apps).to_sql("dim_application", engine, if_exists="replace", index=False)
display_tables(['transaction_f','dim_application'])

transaction_f (500, 5)

   id                 created_ts  client_key   amount  application_id
0   1 2023-06-19 17:03:52.611359        1032  2980.90              12
1   2 2023-07-09 07:47:09.316858        1141  3057.16              13
2   3 2023-11-20 17:29:19.068888        1012  4484.21              12
3   4 2023-10-30 23:37:44.512338        1096  1337.34              13
4   5 2023-11-17 16:58:48.741578        1193  1988.65              12

dim_application (2, 5)

   id  application_id application_name row_actual_from row_actual_to
0   1              12             Taxi      2023-01-01    2099-12-31
1   2              13     SuperAppPlus      2023-01-01    2099-12-31

Посчитать накопительно (кумулятивно) на каждый день за май 2023  (c 1 по 31) сумму транзакций:
- по каждому клиенту

In [13]:
query4_1 = text("""
WITH daily AS (
    SELECT
        client_key,
        DATE(created_ts) AS dt,
        SUM(amount) AS daily_amount
    FROM transaction_f
    WHERE created_ts BETWEEN '2023-05-01' AND '2023-05-31'
    GROUP BY client_key, DATE(created_ts)
)
SELECT
    client_key,
    dt,
    SUM(daily_amount) OVER (PARTITION BY client_key ORDER BY dt) AS cumulative_sum
FROM daily
ORDER BY client_key, dt;
""")

df4_clients = pd.read_sql(query4_1, engine)
df4_clients.head(20)

    client_key          dt  cumulative_sum
0         1003  2023-05-23          119.38
1         1004  2023-05-05         3761.07
2         1005  2023-05-24         4855.75
3         1006  2023-05-22         1033.08
4         1008  2023-05-21         2743.83
5         1008  2023-05-23         6235.68
6         1014  2023-05-25         4004.40
7         1018  2023-05-08         3263.33
8         1023  2023-05-12         1587.14
9         1029  2023-05-08         1544.02
10        1035  2023-05-29         3727.93
11        1039  2023-05-23          355.46
12        1040  2023-05-11         1195.14
13        1042  2023-05-24         1444.72
14        1044  2023-05-29         3905.94
15        1045  2023-05-02         2401.66
16        1046  2023-05-28           19.81
17        1053  2023-05-04          684.34
18        1057  2023-05-27         4115.50
19        1066  2023-05-07         2463.47

- по каждому  приложению (с названием приложения)

In [14]:
query4_2 = text("""
WITH dates AS (
    SELECT
        generate_series(
            DATE '2023-05-01',
            DATE '2023-05-31',
            INTERVAL '1 day'
        )::date AS dt
),

apps AS (
    SELECT DISTINCT
        dim_application.application_id,
        dim_application.application_name
    FROM dim_application
),

calendar AS (
    SELECT
        apps.application_id,
        apps.application_name,
        dates.dt
    FROM apps
    CROSS JOIN dates
),

daily AS (
    SELECT
        transaction_f.application_id,
        DATE(transaction_f.created_ts) AS dt,
        SUM(transaction_f.amount) AS daily_amount
    FROM transaction_f
    WHERE transaction_f.created_ts BETWEEN '2023-05-01' AND '2023-05-31'
    GROUP BY
        transaction_f.application_id,
        DATE(transaction_f.created_ts)
)

SELECT
    calendar.application_name,
    calendar.dt,
    SUM(COALESCE(daily.daily_amount, 0)) OVER (
        PARTITION BY calendar.application_name
        ORDER BY calendar.dt
    ) AS cumulative_sum
FROM calendar
LEFT JOIN daily
    ON calendar.application_id = daily.application_id
   AND calendar.dt = daily.dt
ORDER BY
    calendar.application_name,
    calendar.dt;
""")

df4_apps = pd.read_sql(query4_2, engine)
display(df4_apps.head(31), df4_apps.tail(31))

   application_name          dt  cumulative_sum
0      SuperAppPlus  2023-05-01            0.00
1      SuperAppPlus  2023-05-02         6775.36
2      SuperAppPlus  2023-05-03         6775.36
3      SuperAppPlus  2023-05-04         6775.36
4      SuperAppPlus  2023-05-05         9871.65
5      SuperAppPlus  2023-05-06         9871.65
6      SuperAppPlus  2023-05-07        14618.72
7      SuperAppPlus  2023-05-08        19426.07
8      SuperAppPlus  2023-05-09        19426.07
9      SuperAppPlus  2023-05-10        20813.50
10     SuperAppPlus  2023-05-11        20813.50
11     SuperAppPlus  2023-05-12        23659.37
12     SuperAppPlus  2023-05-13        25431.32
13     SuperAppPlus  2023-05-14        25431.32
14     SuperAppPlus  2023-05-15        25431.32
15     SuperAppPlus  2023-05-16        25431.32
16     SuperAppPlus  2023-05-17        25431.32
17     SuperAppPlus  2023-05-18        25431.32
18     SuperAppPlus  2023-05-19        25431.32
19     SuperAppPlus  2023-05-20        29954.02
20     SuperAppPlus  2023-05-21        29954.02
21     SuperAppPlus  2023-05-22        29954.02
22     SuperAppPlus  2023-05-23        34293.32
23     SuperAppPlus  2023-05-24        39149.07
24     SuperAppPlus  2023-05-25        43153.47
25     SuperAppPlus  2023-05-26        43540.51
26     SuperAppPlus  2023-05-27        43540.51
27     SuperAppPlus  2023-05-28        43560.32
28     SuperAppPlus  2023-05-29        52589.74
29     SuperAppPlus  2023-05-30        52589.74
30     SuperAppPlus  2023-05-31        52589.74

   application_name          dt  cumulative_sum
31             Taxi  2023-05-01         3808.17
32             Taxi  2023-05-02         8762.67
33             Taxi  2023-05-03         8762.67
34             Taxi  2023-05-04         9994.10
35             Taxi  2023-05-05        16009.69
36             Taxi  2023-05-06        21299.34
37             Taxi  2023-05-07        22329.92
38             Taxi  2023-05-08        22329.92
39             Taxi  2023-05-09        22329.92
40             Taxi  2023-05-10        23834.78
41             Taxi  2023-05-11        25062.09
42             Taxi  2023-05-12        26649.23
43             Taxi  2023-05-13        26649.23
44             Taxi  2023-05-14        26649.23
45             Taxi  2023-05-15        27533.61
46             Taxi  2023-05-16        27533.61
47             Taxi  2023-05-17        35500.37
48             Taxi  2023-05-18        35500.37
49             Taxi  2023-05-19        35500.37
50             Taxi  2023-05-20        42717.18
51             Taxi  2023-05-21        51980.43
52             Taxi  2023-05-22        60516.66
53             Taxi  2023-05-23        64008.51
54             Taxi  2023-05-24        65453.23
55             Taxi  2023-05-25        65453.23
56             Taxi  2023-05-26        69004.90
57             Taxi  2023-05-27        73120.40
58             Taxi  2023-05-28        73120.40
59             Taxi  2023-05-29        77725.17
60             Taxi  2023-05-30        80197.31
61             Taxi  2023-05-31        80197.31

# Task: 5

In [15]:
# ---------- fact_events ----------
facts = []
for i in range(1, 501):
    ts = fake.date_time_between_dates(
        datetime_start=datetime(2023,7,1), datetime_end=datetime(2023,12,31)
    )
    facts.append({
        "id": i,
        "event_ts": ts,
        "user_id": f"{random.randint(1000,2000)}",
        "business_domain": random.choice(["Taxi","SuperApp","Market"]),
        "client_id": random.choice(["desktop","mobile"]),
        "event_name": fake.word()
    })
pd.DataFrame(facts).to_sql("fact_events", engine, if_exists="replace", index=False)
display_tables(['fact_events'])

fact_events (500, 6)

   id                   event_ts user_id business_domain client_id event_name
0   1 2023-12-24 02:45:31.523341    1035            Taxi   desktop       face
1   2 2023-11-21 23:26:13.006150    1030            Taxi   desktop       else
2   3 2023-11-29 20:00:03.240835    1988            Taxi    mobile      those
3   4 2023-12-10 10:35:03.839387    1350        SuperApp   desktop       life
4   5 2023-07-16 11:46:25.581994    1067            Taxi    mobile       none

Представьте, что у вас есть лог событий по пользователям, у которых сквозной идентификатор по всем направлениям  бизнеса экосистемы корпорации (такси, суперапп, марткетплейс и т.д.) <br>
Напишите запрос, который возвращает приложение (столбец  business_domain ) с наибольшим числом пользователей, которые использовали только desktop. Пользователей, которые использовали хотя бы одно из мобильных приложений экосистемы нужно исключить.

In [16]:
query5 = text("""
WITH user_flags AS (
    SELECT
        fact_events.user_id,
        MAX(CASE WHEN fact_events.client_id = 'mobile' THEN 1 ELSE 0 END) AS has_mobile,
        MAX(CASE WHEN fact_events.client_id = 'desktop' THEN 1 ELSE 0 END) AS has_desktop
    FROM fact_events
    GROUP BY
        fact_events.user_id
),

desktop_only_users AS (
    SELECT
        user_flags.user_id
    FROM user_flags
    WHERE user_flags.has_desktop = 1
      AND user_flags.has_mobile = 0
),

user_domains AS (
    SELECT DISTINCT
        fact_events.user_id,
        fact_events.business_domain
    FROM fact_events
    JOIN desktop_only_users
        ON fact_events.user_id = desktop_only_users.user_id
)

SELECT
    user_domains.business_domain,
    COUNT(user_domains.user_id) AS desktop_only_users
FROM user_domains
GROUP BY
    user_domains.business_domain
ORDER BY
    desktop_only_users DESC
LIMIT 1;
""")

df5 = pd.read_sql(query5, engine)
df5

  business_domain  desktop_only_users
0        SuperApp                  70

# Answers export

In [19]:
# создаём директорию, если ещё нет
os.makedirs("query", exist_ok=True)

# словарь с переменными-запросами
queries = {
    "1.1 Доставляемость по кампании.sql": query1_1,
    "1.2 Доставляемость по каналу.sql": query1_2,
    "2. Определить сессии пользователей.sql": query2,
    "3. Определить топ событий заканчивающих сессию.sql": query3,
    "4.1 Кумулятивная сумма по клиенту.sql": query4_1,
    "4.2 Кумулятивная сумма по приложению.sql": query4_2,
    "5. Приложение с наибольшим числом пользователей.sql": query5
}

# сохраняем каждый запрос в отдельный файл
for filename, sql_text in queries.items():
    with open(os.path.join("query", filename), "w") as f:
        f.write(sql_text.text.strip())

os.listdir("query")

['5. Приложение с наибольшим числом пользователей.sql',
 '4.1 Кумулятивная сумма по клиенту.sql',
 '1.2 Доставляемость по каналу.sql',
 '3. Определить топ событий заканчивающих сессию.sql',
 '4.2 Кумулятивная сумма по приложению.sql',
 '2. Определить сессии пользователей.sql',
 '1.1 Доставляемость по кампании.sql']

In [18]:
!open .